{
  "name": "Aternety",
  "website": "https://aternety.com",
  "twitter": "https://twitter.com/aternety_ftso",
  "general": "We are a team of two. Antonio is a full stack engineer with a background in futures trading. Benjamin is a PhD ML scientist with a background on autonomous vehicles. We also run ftso.dev, though we haven’t put much work into it lately. Antonio lives in Chicago and Ben lives in Detroit. ",
  "infrastructure": "We use aws primarily. Our monthly cost is around $1,200. We also have a server than we run at home. We got it initially for the state connector, but we’ve repurpose to train the ml models in python. Though lately we moved from a random forest model to a weighted variance which is not really using ML, but just statistics. We run a songbird node and a flare node. We also run a data collector that constantly saving prices to a sql database. Every second, non stop. Every hour we also archive prices, and epoch results to an s3 bucket for historical reasons. Ben is currently using this historical data to work on a new prediction algorithm.",
  "safeguards": "Yes. We have our own custom submitter that pulls predictions made by the python program from the db. Before submitting predictions it also pulls prices in USD only using ccxt and if the price in the prediction has deviated by a set percentage, currently set at 4% it will use the USD price and ignore the prediction.",
  "availability": "It was in the very beginning. About three weeks ago songbird went live. I think it was around end of august 2021. Our node went down once because it ran out of disk space. We had to increase the size of the elastic volume on our ec2. We’ve also encountered issues when our submitter would disconnect from the node. We added reconnect logic and also have rollbar hooked up to alert us if our apps encounter errors. Lastly we built a custom alert system that will alert us if we haven’t submitted in the last three epochs. This simply looks at the submission data in our db that inserted by our data collector.",
  "selling": "We have a long term strategy. We currently have a system of arbitraging between a few exchanges. The goal is to increase our holdings as much as possible because we believe flare will be very valuable in the future. We didn’t really have a problem with losses until the end of last year. Probably from September to December we operated at a loss, so during those times we sold some sgb to cover operating expenses. ",
  "tooling": "So far we’ve built ftso.dev. It’s a site like flare metrics. ",
  "sgb_claim_addresses": ["0x2de2c741658f0ae7b2ddd8eadd179911564af119"],
  "flr_claim_addresses": ["0xd3956f862a4960bb4937e596a2baecffcbb4b3e0"]
}
