{
  "name": "Atlas TSO",
  "website": "https://tsoatlas.xyz",
  "twitter": "https://twitter.com/TsoAtlas",
  "general": "Greece. 3 Member team. Kostas - Lead dev. Computer Science degree, Data science and ML courses. Thanos - dev. Graphics artist degree, Last year in Computer Science, ML courses. Billy - Mathematics. Mathematics degree. FTSO only team.",
  "infrastructure": "We run our own infrastructure. Currently we run 6 VM. 4 running OBS nodes, some full history, one of them will turn into Validator nodes. 2 running the provider. The costs are around 1k per month.",
  "safeguards": "Our code currently has 3 safeguards. A depeg safeguard for stablecoin. An antipump mechanism for exchanges. And a submission safeguard, where we cannot post a price that is too far away from a core of big exchanges with the most volume.",
  "availability": "September 18th - Songbird. October 6th - Flare. We have been offline a few times due to bugs crashing the provider. Both times we were able to identify the bug and fix it. We get notified when provider is not submitting by a program we have created, so unless its the night and we are sleeping we can fix it fast.",
  "selling": "We have announced publicly that we will be keeping 40% of rewards and sell 60% regardless of market conditions. We were interested from the start to be as transparent as possible, so community knows what to expect. We are selling with 2 methods, either trigger sales,so they do not influence sentiment or when there is a big buy order showing someone that really wants to buy in, so it doesn't affect price for a short period of time. That being said we do what feels right for us and we don't judge other providers selling their rewards if that feels what they should do for their business.",
  "tooling": "We currently have a few tools for checking collusion and provider relationships, although we don't plan to release anything public and its only being used internally to help us and other providers identify \"outliers\". We are in the process of creating other things but we are not ready to share yet.",
  "sgb_claim_addresses": ["0xC5d083F6Ffc883BA45cf7C7598cddeb4364640Ca"],
  "flr_claim_addresses": ["0xC5d083F6Ffc883BA45cf7C7598cddeb4364640Ca"]
}
