{
  "name": "CFN",
  "website": "https://cryptapero.fr",
  "twitter": "https://twitter.com/cryptapero",
  "general": "One technical guy team - France - Systems architect in a worldwide company IRL. Three kids. Being a father definitely requiring skillset haha",
  "infrastructure": "I run my own infrastructure  4 servers cloud hosted. 1 for each node (Songbird / Flarenetwork)  1 to run Data Providers algorithms. 1 for the validator    And 1 server self hosted to run the CFN Discord bot which handles weekly community airdrops as well as monitoring tools. Average monthly cost : $450",
  "safeguards": "Yes. Safeguards and failover mechanisms against depegs or exchanges unavailability.",
  "availability": "STSO : September 2022  FTSO : October 2022  STSO went down once due to too low vote power.",
  "selling": "Never sold any SGB / FLR I earned wether it is through fees or grant. Being a service provider is part of my DCA/Passive income accumulation strategy during the bear market. It is my daily job which pay the bills today. I share 25% of my fees with CFN NFT holders to help them build their own passive income strategy, and thank them for supporting me and my work.",
  "tooling": "I wrote around 65 articles since early 2021, natively in french, on Flare ecosystem to help people understand how the network works as there were no content on french about it. Started with Flare only, then FLRFinance to learn about DeFi, NFTs, projects I have been interested in along the way and off topics such as security, wallets etc. I have less time for it since I started the Data Providers unfortunately. It's very time consuming. I do my best to be as available as I can for the french community to answer their questions, on Twitter and on CFN Discord, support Flare in its entirety and most importantly : have fun. I say it regularly, I do not promise anything but to do my best and if eventually we fail, we would have fun all together during that time. I wish I have more free time to build dApps and so on but I am limited today due to my full time job and my family which is my absolute priority.",
  "sgb_claim_addresses": ["0x889fd8c79fcc81e619b720bd589154c2c9fd74e9"],
  "flr_claim_addresses": ["0xf12f09E8Ee7E0C0D0b3279120325A97dc821E971"]
}
