{
  "name": "Envision",
  "website": "https://www.envisionftso.com",
  "twitter": "https://twitter.com/EnvisionFTSO",
  "general": "Envision is a 2-person team based in Gibraltar, an overseas British territory at the southernmost tip of continental Europe. We have over 20 years combined experience in building and delivering technology solutions.",
  "infrastructure": "The Envision setup consists of three core elements; data sourcing, data processing and chain operations. We capture price data directly from crypto exchanges and utilise a combination of REST and WebSocket APIs. Currently we have connections with 15 exchanges and collect price data in the last minute of each epoch. This information is saved to a SQL database for analysis and processing. During the processing stage, data that does not match our 'good price' criteria is removed before being fed into our algorithms, which process the data to determine a single price for each coin. This price is then submitted to the FTSO. All infrastructure is hosted and managed in AWS as we feel it is the most reliable, despite availability of cheaper options. We have dedicated nodes for Flare and Songbird running in different AWS regions, with database and applications also set up to run in separate regions, offering further resilience. Our Flare submitter node currently acts as our validator observation node but we also have a backup node running that will be migrated over to be a full validator node when Phase 2 begins. Hosting and infrastructure management costs (as at May-23) are circa. £1,800 p/m.",
  "safeguards": "Envision's approach to data integrity is a key part of our overall strategy, with focus on analysis and removal of any price data that does not fit our strict criteria. Exchanges commonly provide rogue data, either as a one-off anomaly, or for extended periods. Our approach is two-fold; as part of the data processing, we find and remove a single bad price in real time, and also continuously review data sources to determine the value they bring to the system. Our target is to add another five data sources over the next two months.. ",
  "availability": "Envision has been submitting data on Songbird since Sep-22 and on Flare since Nov-22. Prior to the first submission we spent around three months studying and learning about Flare and the FTSO system and designing/building our infrastructure and algorithms. For the first few months of live operation our reward rates were quite low and we had occasional downtime. Due to setup optimisation and increasing familiarity with running nodes we are now experiencing much less downtime, and we released a major algorithm upgrade in early Apr-23, which has greatly improved our reward rates. Continuous improvement is important and we will always look for ways to do things better and more efficiently.",
  "selling": "Envision believes in the growth of the network and to date have only sold tokens to fund operational costs.",
  "tooling": "Outside of the ongoing core FTSO work, we are creating educational content to bring value to the community, particularly newcomers to the industry and Flare ecosystem. We have created a few tutorial videos, which walkthrough the process of interacting with Flare or Songbird, e.g. how to setup autoclaiming and how to check FlareDrop eligibility. With plans to expand on this content, we welcome feedback and opinions from the community to help guide us on the type of content that we create. We also have longer term plans to create some interactive metrics for our website and create an application to encourage and assist with deeper network interaction.",
  "sgb_claim_addresses": ["0x58Cd43E9FcdBd4D0F507aB4f6029dB8032746da8"],
  "flr_claim_addresses": ["0x9b42B895D2A10D048eaf4996fDf93aEBf59167BF"]
}
