{
  "name": "FlareFTSO",
  "website": "https://flareftso.com",
  "twitter": "https://twitter.com/flareftso",
  "general": "FlareFTSO is USA based and have been a small team in the Flare ecosystem from the get go. IT, Development (front-end and back-end), Enterprise systems, Web2.0, Web3, Database, Hardware, Networking, Tech background. Unfortunately, we have lost a number of team members to other projects (i.e. SORA, Gala Games, XRP, etc.)  due to the low native token prices and operating at a loss. One of our principal founders, and developer of our FTSO, stayed true to the Flare ecosystem and plans to rebuild a robust team. We have invested a lot of time and energy in developing our own algorithms in-house, and trying to provide accurate prices based on exchange data, versus some of the nefarious/colluding approaches (i.e. shared algorithms) used by some.",
  "infrastructure": "FlareFTSO manages our own infrastructure. Our primary servers are bare metal servers with a respected cloud provider. We also host our own development servers. The cost ranges, and we have been north of $1500/month for infrastructure to handle redundant nodes, databases, price collectors, ftsos, monitors, analytics, websites, dApps, and development. We have downed many of our servers to reduce costs, but will be investing heavily on infrastructure in the near future to run validator services.",
  "safeguards": "Yes, FlareFTSO has a number of safeguards in place including stablecoin depegging where we will switch to USD markets only. We also handle some cases of exchange outages, anomalies, and illiquidity. If new use cases pop up, we use it as an opportunity to improve our algorithms.",
  "availability": "FlareFTSO has been involved with the Flare ecosystem, running Coston nodes before Songbird's availability. We've been submitting Songbird prices since 10/12/2021 (Epoch 3 due to whitelisting) and Flare prices since 07/23/2022 (Epoch 1). Our FTSO availability has been pretty good with minimal outages, and we are alerted 24/7 if we have issues with different parts of our infrastructure. When facing issues, outages were usually short-lived as we switched over to fail-over servers. Many lessons learned to improve our stability. During the early Songbird days we experimented with different node databases and provided insight to the FTSO community. (i.e. running LevelDB versus RocksDB)  We did face ever growing database sizes, and buggy provided RocksDB implementations, causing us to upgrade our servers.",
  "selling": "FlareFTSO has been HDLRs in support of the network with a hopeful eye on the moon. Infrastructure, tax, and other costs have come out of our own invested capital. This may change in the future to stay solvent.",
  "tooling": "FlareFTSO has developed various FTSO dApps. Besides the FTSO data submission, we also have dApps for wrapping, delegation, rewards, monitoring/statistics, and have explored other dApp projects. Standard web 2.0/database/graphing/analytics tools have also been developed. Most are internal and have not been released to community, needing further regulatory clarity."
}
