{
  "name": "Flare.Space",
  "website": "https://flare.space",
  "twitter": "https://twitter.com/flare_dot_space",
  "general": "We're an Europe based FTSO, validator, dApp creator and an active member of the community. Our team consists of more than 10 experts, mostly PhDs and MScs specialised in Blockchain & Software development, applied mathematics, business models and data science. We're in the process of expanding our team to continue our efforts in providing usability to the network.",
  "infrastructure": "We use several cloud providers and our own hardware / infrastructure. Duplicated infrastructure for submitting customized prices for Songbird and for Flare. Our costs are approx.:  - 10,000 EUR / month for infrastructure  - 10,000 EUR / month for algorithm development and data science  - 40,000 EUR / month for dApp and content developers  - VAT and other taxes.",
  "safeguards": "Yes; lots of them, different safeguards (on volume, price pairs etc.) and automatic detection of strange data streams. Duplicated infrastructure, nodes and multiple backup/failover scenarios. ",
  "availability": "On Flare we began submitting in September / October 2022, on Songbird we began at the end of December 2023. We began with the development of dApps already in June 2022. We operated smoothly all this time, with two isolated situations where we stopped working for few hours 1) switched infrastructure and 2) our IP changed and had to wait for API whitelisting. Smaller incidences are detected automatically and were fixed promptly.",
  "selling": "On average, approx. 50% of all our rewards will have to be sold to cover taxes and our expenses (infra, team). This is one of our main income streams to provide (for free) content, insights, data, charts, tools, dApps etc., for the community, such as FIP.01 Simulator, History, Twitter content etc. If due to all changes because of the governance, rewards will be lower, we might decide to sell more (of one or both tokens), to cover our costs. We will consider market conditions when we will sell.",
  "tooling": "We've created several products such as our Flare.space Hub, Transaction History dApp, FIP.01 Simulator, Distribution simulator, Governance analytics etc. We are planning to add to this collection of product but are careful in terms of impact and complexity when considering new ideas. You can find all our products and helpful information on our website, https://flare.space."
}
