{
  "name": "Flare Portal",
  "website": "https://flareportal.com",
  "general": "Flare Portal is a Data Provider on Songbird (since beginning of 2022) & Flare Network with the goal to submit the most accurate data. We are running our own Nodes since the start. Flare Portal is delivering the following services / added value for the community and network, which we will keep extending:  - Data Provider on Songbird & Flare network  - Songbird & Flare network Nodes on own infrastructure  - Flare Statistics (https://flareportal.com/home/ftso-metrics/)  - Flare Forum (https://flareportal.com/community/)  - Flare Chat (https://flareportal.com/flarechat/)    Planned services (pending release):  - Validator Nodes  - xApp    Flare Portal - Team  Flare Portal is based in the Netherlands and exist out of two persons who have passion for IT and building added value products from scratch. The members have their background in SAP ERP and worked globally for a large variety of industries. The team worked intensively together in the past for a couple of years, which makes the team robust, efficient and a good foundation for long-term growth.",
  "infrastructure": "Flare Portal is running Songbird & Flare Nodes on own high quality, fast, secured Infrastructure. The infrastructure is supported by 27 solar panels in addition to the grid.",
  "safeguards": "Flare Portal's algorithm is optimized (wasn't in the past) to handle extremely volatile market conditions, stable-coin de-pegging, exchanges liquidations and more, which makes it a robust algorithm. The algorithm, analyses tools / other supporting tools have been fully developed by the Flare Portal team. As part of the FTSO fraternity, it is imperative that as a Data Provider we have provident independent and unbiased data. You can find us to be way apart in the collusion list on both the Songbird and Flare environments. ",
  "availability": "Flare Portal statistics - Songbird Network  - 288,048 transactions executed  - First data submission around: 13th Feburary 2022  - Own nodes and algorithm: yes    Flare Portal statistics - Flare Network  - 152,902 transactions executed  - First data submission:  20th July 2022  - Own nodes and algorithm: yes    Flare Portal started submitting data on Songbird Network in Feburary 2022 and Flare Network in July 2022. During that period we did have a few downtime moments, for example power outage / internet outage (which rarely occurs in this area, however occured due to nearby construction work). We also did have downtime moments when we were optimizing our functionality and made a few mistakes. Solutions (like switching to other ISP, backup connection) from lessons learned were applied which did result in a high uptime. During the first year - Delegation Voting Power mainly went to the top 10 FTSO's which didn't enable us to further large investments.",
  "selling": "0% rewarded, bought or granted Songbird or Flare has been sold since the foundation of Flare Portal. The reward is send to team-members who 100% delegated their rewards so far. We believe in the grow of the network and it's strenght which has not come to fruition and majurity yet. Flare Portal was founded with a solid financial buffer and we tried to keep cost low, which means we didn't have to sell anything yet. In the future we have to, to cover cost and do further investments. In case of sales, it can be tracked via the below Flare Portal address and it will be communited via Twitter or at https://flareportal.com for full transparancy. Flare Portal SGB/FLR Address: 0x9225db8B30A59D8Dd15448E2E5918BD160262b5D.",
  "tooling": "Delivered services:  - Flare / Songbird FTSO Statistics (https://flareportal.com/home/ftso-metrics/)  - Flare Forum (https://flareportal.com/community/)  - Flare Chat (https://flareportal.com/flarechat/)    Pending approval for public release:  Flare Portal - XUMM xApp  We are waiting for public release of Flare Portal XUMM xApp. This app provides FTSO's listed and sorted decending on their ‘Reward Rate’. The Flare Portal xApp provides key information to support selecting on the delegation process. Data is updated as per (in the xApp) indicated interval / last updated information. Planned developments:  We will gather input from Community members on planned development to ensure we match demand. Once a development has reached a certain development level we can share more information.",
  "sgb_claim_addresses": "0x9225db8B30A59D8Dd15448E2E5918BD160262b5D",
  "flr_claim_addresses": "0x9225db8B30A59D8Dd15448E2E5918BD160262b5D"
}