{"general": "Flare Beacon - FTSO team, with IT background.   It requires a very good skillset to develop a proper TSO from the ground up that can be reliable to the network. There are a lot of different skills required: development, blockchain, infrastructure, security, scripting.  Months and months were/are spent researching, trying, modifying, applying. It's a full time job (if people decide to take it serious and don't settle with the basic).   This is a complex and heavy task, unless you take shortcuts like some and just get the prices to submit from network leeches. They even use a public nodes cause they don't even own a node(it's costly) which they should.  These TSO affect both community and lower performing TSO, cause they narrow down the reward band making it more difficult to hit the prices.", "infrastructure": "Flare Beacon - it depends on several aspects as mentioned above but one can have the idea using the aws or azure calculate tool. It also depends how much secure you want to be. How much replication and redundancy you want to have. If you will be a validator node or not.  Some TSO will have a more complex setup than others.   It's like comparing a top tier car to a lower one, both can ride but in certain situations you will be glad to own a top tier.", "safeguards": "Flare Beacon - yes, it contains protections against outliers and depeg situations. We also get our data mainly from exchanges considered to have good liquidity.", "availability": "Flare Beacon - can't be very precise since the TSO have a lot of transactions. But since FLR is more recent, we are submiting since the 1st epoch and we should have 99.99% availability rate.  It never went down, and we never had to do any intervention yet.", "selling": "Flare Beacon - 0 FLR sold from epoch rewards    Flare Beacon -  We do sell SGB rewards but the price has not been favorable so we are going to the 3rd epoch without selling SGB rewards.  We don't have much delegations on SGB anyways and only past 2 weeks we improved our algo, so at best we are talking about $200 a week.   Half of that if we compare with the previous algo.    There is something that we would like to see in the questionaire which is the intelectual property. The time spent by developers putting together all the requirements to run a TSO, node, etc. The time spent reasearching and developing a TSO code and infra. The time spent deploying, maintaining and monitoring.  If you put a price on that, probably majority TSO are on loss. Except ofc the leeches we stated before.", "tooling": "Flare Beacon - We plan to build on FLR, but for that we need to invest and increase the team. For now is just ideas.", "sgb_claim_address": "Flare Beacon - From now on is going to a HW address. Can be seen onchain", "flr_claim_address": "Flare Beacon - From now on is going to a HW address. Can be seen onchain"}