{
  "name": "FLR LABS",
  "website": "https://flrlabs.com",
  "twitter": "https://twitter.com/FLR_LABS",
  "general": "FLR Labs was founded by Lukas Alexs and his brother Nick, who were early participants and believers in the potential of the Flare Network. They set out to build a team of skilled developers who share the same passion for Flare and are dedicated to building and supporting its growth. Lukas Alexs, as the Chief Executive Officer, sets the company's strategy and vision, oversees day-to-day operations, builds a high-performing executive team, and maintains relationships with stakeholders, ensures the company's financial performance and growth, and makes important executive decisions. Nick Alexs, as the Chief Strategy Officer, is responsible for overseeing the development and implementation of the long-term strategic plan, evaluating market trends, conducting competitor analysis, and identifying new business opportunities. In addition to these core responsibilities, he also works closely with Lukas Alexs, the CEO, to ensure that the company's strategy aligns with its overall vision and goals. As the CSO, Nick leads the company's efforts to innovate and drive growth, identifying new markets and developing strategies to enter them. He is also responsible for identifying potential risks and creating contingency plans to mitigate them. Rafi Banai serves as the Chief Technology Officer CTO is responsible for overseeing the development and implementation of the company's technical strategies, goals, and initiatives. His skills include proficiency in programming languages, expertise in time series analysis and forecasting techniques, knowledge of statistical and mathematical methods for time series analysis, experience in database management and data warehousing, familiarity with machine learning techniques and AI modelling, understanding of distributed systems and cloud computing, strong analytical and problem-solving skills, excellent communication skills for team collaboration, and expertise in blockchain technology and smart contracts. Our senior Developer (private) is responsible for developing our future collection of the Dapps using the Solidity programming language on the Ethereum. They have a strong expertise in Solidity programming, as well as be knowledgeable and skilled in developing both front-end and back-end software applications. As full-stack developer, they will be able to efficiently develop and deploy secure smart contracts, while also ensuring the reliability and security of the overall web application. The team at FLR Labs continuously engages with developers to build decentralised applications (dapps) on the Flare Network, with the mission and priority of supporting the growth of the Flare Network by providing valuable services and solutions to its users. We strive to build leading platforms for decentralised applications and services, bringing innovation and progress to the world of decentralised technology. Attention all developers! If you're interested in joining our team, we would love to hear from you. Please feel free to message us and apply for a developer role on LinkedIn. We welcome developers with a passion for innovation and a desire to work on exciting new projects. Come be a part of our dynamic and talented team!",
  "infrastructure": "FTSO Data Provider Infrastructure: At FLR Labs, our infrastructure includes an Ubuntu 22.04 operating system that has been optimized for security and performance. Our FTSO Data Provider Infrastructure consists of a total of four machines. Two observer nodes retrieve real-time data from various sources, including CEXs and DEXs, and submit it to the FTSO for validation for both Songbird (SGB) and Flare (FLR). Additionally, two machines are required to run programs for each network. To store our applications and data, we use a Cloudzy database that provides scalable and reliable storage. We also implement monitoring and alerting tools, backup and recovery systems, security measures, and machine learning, deep learning, and AI modeling methods for data enrichment. To ensure the security of our infrastructure and protect against potential threats, we have set up firewalls that provide an additional layer of protection. These firewalls monitor and filter network traffic to prevent unauthorized access and protect against common cyber threats. Dapp Infrastructure: Our new Dapp, Volume One, is currently hosted on Amazon Web Services, and we have spent approximately $178 on Relational Database Services. Going forward, we expect this cost to be around $50 per month. Additionally, we have obtained a Standard Wildcard SSL for $749 to ensure secure connections. Total Monthly Costs: For FTSO Data Provider and Dapp Infrastructure, we anticipate a monthly cost of $650 USD.",
  "safeguards": "To protect against outside forces such as stablecoin depegs and exchange liquidations, our FTSO algorithm deploys network safeguards including diversification of data collected, real-time monitoring, cryptographic security, decentralisation, data backup and recovery, network monitoring and alerting, access control, and has regular software updates. ",
  "availability": "STSO begun submitting prices EPOC 68 FTSO begun submitting prices to EPOC 52",
  "selling": "As a new FTSO, we have self-funded our operations from the beginning and have not received grants from the Flare grants program. However, we are committed to the long-term growth of our company and are willing to reinvest in our development. To ensure sustainable operation, we allocate 10% of our rewards to our business operating account for ongoing expenses. Additionally, we allocate 40% of our token rewards to a long-term treasury account (0xb1D7D56F307741F24b434F6dc73c3f29A5D899Bd) and 50% to an escrow account (0x6Fc5F4923dBc5FAfA2befd50Dc42b9C629e66E16). Our website features a detailed transparency section that outlines the purpose of each allocation. We plan to finalize our application proposals and submit them to the Flare Grants Program to receive additional funding.",
  "tooling": "Delegation Dapp V1 Beta: The FLR LABS Delegation Dapp streamlines user participation in the Flare Time Series Oracle (FTSO) network by providing a comprehensive interface that compiles extensive information about data providers and the FTSO system. This user-friendly interface incentivizes Flare (FLR) and Songbird (SGB) token holders to confidently delegate tokens to data providers, contribute to decentralization, and earn rewards. With the FLR LABS Dapp, users can seamlessly send, wrap, delegate, and claim rewards for their tokens. Additionally, the Dapp offers a wallet portfolio page that displays users' assets and estimated USD value, further simplifying their experience. Dapp V2: NFT Mint Site and NFT Drop: FLR LABS is excited to announce our exclusive Mutated Time Travelers Collection. 1000 Mutated Scientists & 3,000 mutated CEO's. We are thrilled to announce that we are working with over 6 talented artists who are all contributing their unique skills and creativity to the designs of our NFT collection as well as looking to expand our team of more solidity smart contract developers. Our goal is to create a NFT collection that stands out in the market and brings value to our users. Additionally, we are exploring innovative ways to allow our NFTs to have utility in future applications that we create, enhancing the overall value of our collection. We are excited about the potential of this project and can't wait to share more details with our community. Dapp V3: Our team is currently undergoing thorough research and development for a new Dapp that utilizes FTSO price data in a game. We believe that by incorporating FTSO price data, we can create a more engaging and dynamic gaming experience for our users. We are committed to ensuring the success of this project and will release our official application proposal whitepaper to the public ounce it is finalized . Our team will launch our future applications after it has completed detailed game theory testing, auditing of smart contracts, and conducting all necessary due diligence as developers. More details about the collection and our roadmap can be found on our website and Discord!",
  "sgb_claim_addresses": ["0x43F0a819DCCddEb05A282c78027873aB5Be35cf5"],
  "flr_claim_addresses": ["0x14b424Bc9E9B8091A40384ff3d8F0C3DfC1a2879"]
}
