{"general": "FLR Labs   Location: Germany      Lukas Alexs, Chief executive officer   Skills and responsibilities in:   -Building and managing a high-performing executive team.  - Actively searching for new developers on LinkedIn to expand our developer team.    -Setting company strategy and vision.  -Overseeing day-to-day operations and making operational decisions.  -Ensuring the company's financial performance and growth.  -Ensuring compliance with legal and regulatory requirements.  -Fostering a positive corporate culture.  -Continuously evaluating and adapting the company's strategy in response to changing market conditions and external factors.      Nick Alexs, Chief Strategy Officer (CSO)   Chief Strategy Officer responsible for overseeing our Dapp development and implementation of the long-term strategic plan, evaluating market trends, conducting competitor analysis, and identifying new business opportunities.    Chief Strategy officer: Senior Blockchain Developer.     Our developer has requested to keep his identity private.       Our developer possesses extensive knowledge and a strong passion for Flare Networks, acquired through years of dedicated study and research. Their expertise has been demonstrated through practical testing on the Coston Network, Songbird, and their current focus, Flare.    Skills:   -Expertise in Time Series Analysis and Forecasting Techniques.  -Proficient in programming languages such as proficiency in Solidity, JavaScript, TypeScript, Python, and SQL is necessary for writing smart contracts, front-end interaction, statically typed development, data processing and analysis, and database management.   -Knowledge of statistical and mathematical methods for time series analysis.  -Experience in database management and data warehousing.  -Familiarity with machine learning techniques.  -Understanding of distributed systems and cloud computing.  -Strong analytical and problem-solving skills.  -Excellent communication skills for team collaboration.  -Knowledge of software development methodologies.  -Expertise in blockchain technology and smart contracts.    ", "infrastructure": "FLR LABS    We run our own infrastructure and have our own unique algorithm.  FLR LABS infrastructure consists of an Observer Node that retrieves real-time data from various sources such as APIs of CEX's and DEX's and submits it to the TSO for validation. The infrastructure also includes a DynamoDB database, cloud computing services such as AWS, a load balancer, monitoring and alerting tools, backup and recovery systems, security measures, and machine learning and AI modelling methods for data enrichment.    Total monthly cost:  $400 USD", "safeguards": "FLR LABS     To protect against outside forces such as stable coin depegs and exchange liquidations, our FTSO algorithm deploys network safeguards including diversification of API data collected, real-time monitoring, cryptographic security, decentralization, data backup and recovery, network monitoring and alerting, access control standards, and regular software updates.  ", "availability": "FLR LABS     STSO begun submitting prices EPOC 68   FTSO begun submitting prices to EPOC 52    Our availability has remained efficient and consistent.", "selling": "FLR LABS     As a newly established FTSO, we have been self-funded from the ground up and have not received grants from the Flare grants program. However, we are committed and bullish on the to the long-term utility of FLR and SGB’S growth so and are willing to invest our own capital to fund our development.      To ensure sustainable operation:   -10% of our rewards will be allocated to our business operating account which will accumulate funds for current ongoing expenses : 0x3826B2F7387F5789DaE57d018638aAdBe1D6188E    -40% of our token rewards will be placed in a long-term treasury account: 0xb1D7D56F307741F24b434F6dc73c3f29A5D899Bd     50% will be held in an escrow account: 0x6Fc5F4923dBc5FAfA2befd50Dc42b9C629e66E16    FLR LABS team is comprised of individuals who are enthusiastic participants in the Flare Networks and are dedicated to the development and implementation of innovative applications using Flare's technology stack. The team's strategy is to reinvest entirely in creative and forward-thinking projects, leveraging the capabilities of Flare's technology to drive growth and advance the goals of the Flare Networks.", "tooling": "FLR LABS  Dapp V1: Website delegation platform (In development)   Dapp V2: We are currently engaging research and development drafts for a V2 Dapps that will use data from the state connector and FTSO protocols  in a creative ways, this will be  revealed shortly.     DAPP V1- Currently in development   1.New features include claim, wrap, delegate functions for each data provider.    2.Displayed epoch status dashboard:  -Displays the current epoch status, including:  -Epoch number, Start time, End time, Data epoch, Vote power block, Total rewards, Claimed rewards, expired rewards                                         3. FTSO price status UI:  -Displays all FTSO token prices.    4. Provides comprehensive information on all FTSO data providers, including:  -Logo  -Name  -Address  -Accuracy  -Current and active vote power  -Current and active VP%  -Total reward  -Current earnings  -Expected earning  -Balance  -Availability  -Reward rate  -Expected reward rate  -Fee   -Whitelist status      FLR LABS Dapp V1 is designed to enhance the overall user experience by providing a more comprehensive and accessible platform for delegators to participate in the FTSO network.", "sgb_claim_address": "0x43F0a819DCCddEb05A282c78027873aB5Be35cf5", "flr_claim_address": "0x14b424Bc9E9B8091A40384ff3d8F0C3DfC1a2879"}