{
  "name": "FLR LABS",
  "website": "https://flrlabs.com",
  "general": "FLR Labs was founded by Lukas Alexs and his brother Nick, who were early participants and believers in the potential of the Flare Network. They set out to build a team of skilled developers who share the same passion for Flare and are dedicated to building and supporting its growth. Lukas Alexs, as the Chief Executive Officer, sets the company's strategy and vision, oversees day-to-day operations, builds a high-performing executive team, and maintains relationships with stakeholders, ensures the company's financial performance and growth, and makes important executive decisions. Nick Alexs, as the Chief Strategy Officer, is responsible for overseeing the development and implementation of the long-term strategic plan, evaluating market trends, conducting competitor analysis, and identifying new business opportunities. In addition to these core responsibilities, he also works closely with Lukas Alexs, the CEO, to ensure that the company's strategy aligns with its overall vision and goals. As the CSO, Nick leads the company's efforts to innovate and drive growth, identifying new markets and developing strategies to enter them. He is also responsible for identifying potential risks and creating contingency plans to mitigate them. Rafi Banai serves as the Chief Technology Officer CTO is responsible for overseeing the development and implementation of the company's technical strategies, goals, and initiatives. His skills include proficiency in programming languages, expertise in time series analysis and forecasting techniques, knowledge of statistical and mathematical methods for time series analysis, experience in database management and data warehousing, familiarity with machine learning techniques and AI modelling, understanding of distributed systems and cloud computing, strong analytical and problem-solving skills, excellent communication skills for team collaboration, and expertise in blockchain technology and smart contracts. Our senior Developer (private) is responsible for developing our future collection of the Dapps using the Solidity programming language on the Ethereum. They have a strong expertise in Solidity programming, as well as be knowledgeable and skilled in developing both front-end and back-end software applications. As full-stack developer, they will be able to efficiently develop and deploy secure smart contracts, while also ensuring the reliability and security of the overall web application. The team at FLR Labs continuously engages with developers to build decentralised applications (dapps) on the Flare Network, with the mission and priority of supporting the growth of the Flare Network by providing valuable services and solutions to its users. We strive to build leading platforms for decentralised applications and services, bringing innovation and progress to the world of decentralised technology. Attention all developers! If you're interested in joining our team, we would love to hear from you. Please feel free to message us and apply for a developer role on LinkedIn. We welcome developers with a passion for innovation and a desire to work on exciting new projects. Come be a part of our dynamic and talented team!",
  "infrastructure": "Our FTSO Data Provider on Flare Network consists of an observer Node and a proprietary in-house built algorithm that retrieves real-time data from various sources, such as CEX’S and DEX’S and submits it to the TSO for validation. Our infrastructure at FLR Labs includes an Ubuntu 22:04 operating system that is optimised for security and performance. We also utilise a Cloudzy database, which provides scalable and reliable storage for our applications and data. Additionally, we implement monitoring and alerting tools, backup and recovery systems, security measures, and machine learning and AI modelling methods for data enrichment. To ensure the security of our infrastructure and protect against potential threats, we have firewalls set up that provide an additional layer of protection. These firewalls monitor and filter network traffic to prevent unauthorised access and protect against common cyber threats. We are also building our Dapp Volume 1 on AWS (Amazon Web Services), a highly scalable and secure cloud platform that enables us to quickly deploy and scale our applications with ease. Total monthly FTSO infrastructure cost:  $450 USD PER MONTH. At FLR Labs, we have additional expenses beyond our infrastructure, including wages for our team members, Dapp development costs, marketing expenses, and other operational costs. We understand the importance of investing in our team and providing fair compensation to attract and retain top talent.",
  "safeguards": "To protect against outside forces such as stablecoin depegs and exchange liquidations, our FTSO algorithm deploys network safeguards including diversification of  data collected, real-time monitoring, cryptographic security, decentralisation, data backup and recovery, network monitoring and alerting, access control, and has regular software updates. ",
  "availability": "STSO begun submitting prices EPOC 68   FTSO begun submitting prices to EPOC 52",
  "selling": "As a newly established FTSO, we have been self-funded from the ground up and have not received grants from the Flare grants program. However, we are committed to the long-term growth of our company and are willing to reinvest into development. To ensure sustainable operation, 10% of our rewards will be allocated to our business operating account which will accumulate funds for ongoing operation expenses. 40% of our token rewards will be placed in a long-term treasury account: 0xb1D7D56F307741F24b434F6dc73c3f29A5D899Bd     50% will be allocated to an escrow account. 0x6Fc5F4923dBc5FAfA2befd50Dc42b9C629e66E16",
  "tooling": "DAPP V1 - Currently in development     1) Will include claim, wrap, delegate, and governance functions on our website. 2) FTSO epoch status UI:  -Displays the current epoch status, including:  -Epoch number, Start time, End time, Data epoch, Vote power block, Total rewards, Claimed rewards, expired rewards. FTSO price status UI:  -Displays all FTSO token prices. 3) Provides comprehensive information on all FTSO data providers, including:  -Logo  -Name  -Address  -Accuracy  -Current and active vote power  -Current and active VP%  -Total reward  -Current earning  -Expected earning  -Balance  -Availability  -Reward rate  -Expected reward rate  -Fee   -Whitelist status      This upgrade is designed to enhance the overall user experience by providing a more comprehensive and accessible platform for delegators to participate in the FTSO network. Our team is currently engaging in research and development for more sophisticated Dapps that will utilise  data from the state connector and FTSO protocols in a creative ways. We invite and encourage members of the Flare community to stay up-to-date with our progress and milestones by following us on Twitter! @FLR_LABS",
  "sgb_claim_addresses": "0x43F0a819DCCddEb05A282c78027873aB5Be35cf5",
  "flr_claim_addresses": "0x14b424Bc9E9B8091A40384ff3d8F0C3DfC1a2879"
}
