{
  "name": "FocusTSO",
  "website": "https://flr.globalfcx.com",
  "twitter": "https://twitter.com/FocusTSO",
  "general": "FocusTSO Data Provider was built by the Focus Global Team. Three core members of the Polish Flare Community — Radek, Mateusz and Andrzej — run an educational portal in Polish language. The portal has expanded to wider communities, so the team is now presenting the content in English and Japanese. The Focus Team also provides tools like Airdrop Simulator and FTSO Delegation Portal.",
  "infrastructure": "Our infrastructure is built on 3 Hetzner VPS/dedicated servers based in various locations in Europe. Flare and Songbird TSO have their own server and for testing purposes we use separate server. To expand our project and build the planned applications and portal we will need some additional resources. The current infrastructure/licences costs are approx. 400$/mo . Our current operational Focus Global project costs are estimated to be over 2000$/mo and we did not switch to full time yet. Many things cannot be valued because we do it with our own skills and experience.",
  "safeguards": "Our servers are located in various locations across Europe. Our servers are capable to handle backup in case of any outage or issues. Servers for test environment is able to take over the mainnet operations for flare and songbird network. Of course all servers are secured by the newest security concepts and with cyber security best practices.",
  "availability": "FocusTSO is proud to be the first Polish Data Provider on the Flare Network. Operating since the end of July 2023, FocusTSO has been whitelisted on the Top100 from the second epoch of operations, thanks to the community.",
  "selling": "We currently do not plan to utilize the rewards we have earned, but in the future, if the costs associated with the development of FTSO increase, we plan to cover its operation from this pool.",
  "tooling": "FocusTSO has very ambitious plans to build on the Flare Network. Launching FTSO was just the first milestone. For now, improving the algorithm for price predictions is our main priority. FocusTSO started on the Flare Network first because the majority of the community holds FLR tokens instead of SGB. However, we plan to launch on Songbird in the very near future. Our goal is to build tools, help support infrastructure, and continue to produce educational content to help people understand the technical aspects of the network.",
  "products": [https://focusflr.app/", "https://ftso.focusflr.app/"],
  "sgb_claim_addresses": [],
  "flr_claim_addresses": ["0xb084575CaCedf7DEdd78329656715651F8f66712"​]
}
