{
  "name": "FTSO AU",
  "website": "https://www.ftso.com.au",
  "twitter": "https://twitter.com/ftso_au",
  "general": "Tim and Neil. We were both raised in Australia with Tim having South African and Neil English heritage. Tim relocated to Dubai in July 2022, when we relocated the HQ of our company, Neil is based in Australia. It's advantageous for Tim to be living in Dubai as the timezone is much friendlier than Australia. We both have extensive backgrounds in various areas of computing and software development, front and back end.",
  "infrastructure": "Our business is 100% AWS cloud based. Services include (all on seperate instances) Songbird (private) full archival node, Songbird (public) pruned node. Flare (private) pruned node. Various data farms & price collectors. Songbird & Flare FTSO servers. OpenVPN server. Load balancers and data back up services. Attestation nodes (not currently running), BTC / DOGE / LTC, Algorand, Rippled. Current AWS costs are approximately USD$5000 / month. We've hired contract external resources such as Data Scientists, AWS Dev Ops and Algorithmic Trading experts who range from $100 - $200/hr. We're both full time+ and have been since March 2021, salaries not disclosed.",
  "safeguards": "Our service is always evolving, we're currently on major release 4 of our STSO & FTSO algorithm. We have various safeguards in place and more to implement. We have developed our own in-house analysis tools for backtesting future algorithms against historical data.",
  "availability": "We've been operating Songbird nodes since mid 2021, providing a public node for users to connect to Songbird via MetaMask, for delegation purposes. On average we have 2m requests to the node each day. We've been submitting on Songbird since epoch 1 and the same on Flare. Availability has been high due to having a backup node, which was used many times in early days before we changed DB. Outages with our submission service have been rectified quickly due to our 7am to 11pm availability 7 days a week. AWS alarms notifying us of outages 24hrs a day have meant very little downtime.",
  "selling": "Originally we'd planned to sell 15-20% of our weekly rewards to cover costs on Songbird. With the declining token price and increased competition we've had to sell more than planned to cover costs for the last 12+ months. We'll sell as required, in order to continue running all necessary infrastructure and public tools.",
  "tooling": "We built the first ALL provider delegation platform app.ftso.au, used by 15k+ delegators weekly and gave the public access to our Songbird node. We've built Flare Metrics - FlareMetrics.io, with more functionality planned. We've created 50+ blog posts, tutorials and YouTube content to educate the users on all things in the Flare ecosystem. We've created Flare Builders - flare.builders to showcase all the great projects being built on Songbird and Flare. More developments planned. Various other projects and extra functionality to existing platforms currently being discussed."
}
