{
  "name": "FTSO.EU",
  "website": "https://www.ftso.eu",
  "general": "FTSO.EU was born when Flare was announced from 3 tech guys coming from the XRP Italian Community. The mission is obviously to commit to a sustainable service but also to continue serving the interests of the Flare community by developing useful tools and proposing improvements. We aim to become together with other good players a long-term point of reference, not only for the signal provider service but also for others to come.",
  "infrastructure": "FTSO.EU does not use cloud infrastructure for production nodes, we host the services in a private data center. We do not want to provide further information as we aim to create a business model around this.",
  "safeguards": "FTSO.EU view is that USD price of a token is different from market to market. In these days crypto markets are heavily influenced by stable coins, cause lot of trade volume is based on them. The ideal situation would be that most of the trading volume was done using FIAT or CBDC, but is still not happening now. In case of a stablecoin heavy depeg, the token/stablecoin market pair should just  be eliminated by the signals that are sent in our opinion. From experience we think that if and when this heavy depeg should happen,  the measures should be taken in a shared way by evaluating the events with the community and with the users of the platforms. Instead, if a stable instead does not depeg heavily but has only a few small ups and downs, introducing conversions based on other markets or imaginative measures would do more harm than good to the accuracy of the prices we have to represent. We are open to define a set of rules to follow talking about stablecoins, but if the rules remain absent aiming for maximum decentralization, this is our vision. In general, our algorithm on Flare already includes mechanisms to minimize impacts on the signals sent where the sources have problems with availability or misaligned prices as in the case of liquidations.",
  "availability": "FTSO.EU is sending signals from day 1 on STSO and FTSO. We have status.ftso.eu web page from which we notify the delegates registered by email and who follow us on twitter/telegram/discord on the problems encountered and the measures taken. In general, only a couple of times in two years have we understood that we have had problems after updating the version of our algorithm, while a couple more times it has happened that there have been geographic networking problems not dependent on us. We are notified in real time on songbird if submissions fail thanks to a system we have built and therefore we can intervene very quickly in case of problems. We're bringing the same system to Flare in these days. We gave the whole community a way to monitor their nodes months ago, it can be found here: https://t.co/plfl8Gz9HQ  This is one of many examples of our ongoing contribution.",
  "selling": "FTSO.EU approximate % rewards sold per epoch (Flare and Songbird). At the moment:  is almost Zero on SongBird;  is Zero on Flare. We are currently investing in the network and selling only for sudden needs at the moment. We are trying to follow a long term strategy as holders without trying to use any trading tools and developing ideas for new use cases.",
  "tooling": "FTSO.EU tools:    ---- online  EvmAllowance.com  AddyExplorer.ftso.eu  FlareDecent.ftso.eu  Flare Node Monitor/Alerting (check answer #4)  Offline Flare Wallet Generator (available on our website)    ---- dismissed  Arbitrage Tool for Flr Finance (2021)  Coston wallet generator (2021)",
  "sgb_claim_addresses": "FTSO.EU on the provider address or on the secondary provider address",
  "flr_claim_addresses": "FTSO.EU on the provider address or on the secondary provider address"
}
