{
  "name": "LightFTSO",
  "website": "https://www.lightft.so",
  "general": "I'm flying solo, based in Mexico",
  "infrastructure": "Yes, of course I run my own infra:  There's redundant observation nodes for Flare and Songbird, two for each one, we've also deployed servers for the State Connector and for a validator node, however, those have been delayed so for the moment they're not running. Infra costs have changed a lot, the highest was around May-September last year at around 1000USD/month. Right now our expenses are around 400-600 USD/month, depending on the electricity bill (Songbird infra has been running locally for about two months, no cloud providers)",
  "safeguards": "Of course, stablecoin depeg safeguards have been active since the Luna fiasco last year, our algo is fine tuned but in case something goes wrong a fallback price comes in action, this price is not fine tuned for the reward band but I consider it a good representation of the market for the running price epoch. Exchange liquidations also don't affect the stability of the system, they simply stop being taken into account via statistical methods.",
  "availability": "LightFTSO began development on September 2021, our first submit was in October 4th 2021 iirc, on Flare, we began submitting prices in July 2022, I think two days after we got the green flag from the Flare dev team.",
  "selling": "On Songbird, I sell every week, this barely covers infra costs. On Flare, haven't sold almost anything except for a fraction of the grant we all were given. Why is this important or relevant though? None of the FTSO providers are a public company ",
  "tooling": "When I found out about flare in 2020,  I built a tool to check your (then called) Spark claim amount, it gained some traction until bigger players like bithomp included that information too. I built a reward claim app for Songbird, it still needs to be updated for Flare. I also built a Flare descentralization checker at the end of last year, however, FTSO.eu got one out there at the same time so I didn't see the need to have both running at the same time. I also shared a reverse proxy server for Flare/Songbird nodes, to allow public infrastructure providers use middlewares to have better control for their operation. Right now I'm still focused on improving my reward rate, I've been rebuilding the system from the ground up in order to make it more efficient, fast, and stay true to the lightness  in my providers' name",
  "sgb_claim_addresses": "I'd rather not share this here, if anyone wants to look it up, its available on the explorers",
  "flr_claim_addresses": "I'd rather not share this here, if anyone wants to look it up, its available on the explorers"
}
