{
  "name": "FTSO London",
  "website": "https://www.ftso.london",
  "twitter": "https://twitter.com/FtsoLondon",
  "general": "We are a group of 2 people with extensive backgrounds in IT and Finance, one based in London and the other in the Cayman Islands. The time zone difference serves us well, creating near 24-hour coverage in terms of fully supporting our FTSO. We are fans of XRP, so it was through the airdrop that we were introduced to Flare. The more we delved into Flare, the more excited became, and FTSO London was finally born.",
  "infrastructure": "We own all the equipment ourselves (firewalls, routers, servers, switches, UPS). We run our nodes and validator servers from offices in Central London with air conditioning and UPS power supplies. We have 2 independent internet lines that run from 2 different service providers. Our monthly costs are around £1850 monthly all inclusive (maintenance and support contract and hardware replacement contracts).",
  "safeguards": "We run backup nodes for both SGB and FLR networks. We also run a backup validator in the event of hardware failure. In order to keep our servers up to date with security patches and the latest tags we use our backup nodes to avoid the need for downtime. Hence our incredible uptime performance history.  As it relates to price submissions, FTSO London tracks USD and also utilizes USDT and USDC pricing converted to the USD. We have safeguard mechanisms in place such that, in the event any stablecoin employed in our algorithm departs a certain percentage from its USD peg, it is effectively ignored.",
  "availability": "FTSO London first submitted prices on the Songbird network in December 2021. We have been uncompromising in our approach when it comes to maintaining a quality FTSO, one in which delegators can fully place their trust. Reliability, availability and accuracy form the three foundational pillars of our core FTSO philosophy. We are also one of the few public data providers that run full archival nodes on both the Songbird and Flare networks.",
  "selling": "FTSO London has a clearly defined trading strategy with a view to mitigating its future commitment concerning future bond requirements. To be a successful validator on the Flare Network, there will be a pre-requirement for each validator to personally stake a significant amount of FLR tokens (possibly in the region of US$150,000 to US$200,000). Whilst our trading strategy does involve selling FLR and SGB, we have not in any shape or form converted these crypto tokens to fiat currency. As a result, from inception to date we have had to fund all FTSO London expenses from personal bank account savings. As and when these future validator bond requirements begin to take effect, we will have significant exposure to FLR for purposes of staking them on the Flare network.",
  "tooling": "Setting up an FTSO is no small undertaking, especially if the intention is to do it properly. FTSO London chose first to focus on investing in a robust IT infrastructure, our one server alone cost us £20,000. We did this because, over time as Flare continues to grow, the demands on FSTO London infrastructure are only going to increase, so we need to have a solid platform on which to build and align FTSO London growth with Flare. We then turned our attention to the algorithm and that is now working very nicely, as many of our loyal delegators for which we are very appreciative can attest to. In terms of marketing, we engaged a professional company to design our website and Twitter profile and we are extremely pleased with the result.",
  "sgb_claim_addresses": ["0x0708a4C813594b7E0218CB4A5D8b75c76AbFc859"],
  "flr_claim_addresses": ["0x4429306b301a0EB573Fa5758BB40AA581255c624"]
}
