{
  "name": "Oracle Beast",
  "website": "https://www.oracle-beast.com",
  "general": "Peter - Distributed Systems Engineer     Alex - Graphic Designer, Full Stack Developer     Kevin - Entrepreneur, Business Formation Agent ",
  "infrastructure": "Yes, we currently run four total nodes. Two on the Songbird network and two on Flare (we intend to transition one node on each respective network into validators when the time comes) we also have two machines running the our providers on both networks. Our total monthly overhead is roughly $1700",
  "safeguards": "Yes we do have safeguards in place that will stop our submissions if they stray too far from the median price on the FTSO. We currently convert all our collected prices from exchanges into USD values. We pay close attention to the exchanges we use to ensure there are no liquidity issues and that they are not showing any sign of destabilizing. ",
  "availability": "We began submitting to the FTSO on Songbird on Jan 2, 2022 and Flare FTSO July 20, 2022     We have experienced numerous events which our provider either stopped submitting or was generating reverted transactions. We have since implemented various systems that restart our provider automatically so this has become far less frequent and prevents any long durations of downtime.",
  "selling": "To date we have sold roughly 30% of Songbird and 15% of Flare earnings. Moving forward we will likely be selling 30% on each network. We have several reasons for this, the main reason is to pay taxes and also to cover a portion of our overhead. I think there has been a lot of confusion around providers sales of earnings and I think the community needs to remember that this is a business and many providers cannot sustain overhead/taxes without selling a portion of earnings. Some providers may be in a position that they do not need to pay taxes on earnings, depending on where they are located. The required infrastructure to run a provider/validator service is very expensive.",
  "tooling": "We have not created any tools or resources for the community yet, although we intend to in the future. We are currently working on a dApp which we intend to release on Songbird in the near future. We will update the Flare Builders website and the community when we are closer to completion. ",
  "sgb_claim_addresses": "0x3ed7b2ccc4ba420cdce2ba232d3efdc13075f16d",
  "flr_claim_addresses": "0x5E2aFfA528DB55feE8cf8cCC41d0A5bb8BaCedC3"
}
