{"general": "Oracle Beast     Currently we are only running an FTSO and validator, but are in the process of building a dApp on sgb and Flr.     We are a team of three operating in the US and we were all friends before we started Oracle Beast.       Peter - Talented developer with a background in distributed systems.    Alex - Developer/Graphic Designer with a history of successful product and branding designs.     Kevin - Serial Entrepreneur with experience in Business formation and financials.     We all have been interested and heavily investing in crypto since around 2015 but Oracle Beast is our first business entity related specific to crypto.", "infrastructure": "Oracle Beast- Yes, we run our own infra on both sgb and flr.     We currently have 5 nodes running on machines in California and Colorado. Half are cloud based and the other half are running on bare metal machines.     A lot of our expenses were made up front with the purchase of machines and annual subscriptions to cloud based servers. Extrapolating those costs on a per-month basis we are right around $1,700/ month in costs the first year with a slight reduction in year 2.", "safeguards": "Oracle Beast -     Yes, we do all our submissions in USD conversions. Our algo gives heavier weights to more liquid exchanges and we pay very close attention to all exchanges in case issues come up at any that we are sourcing data from.", "availability": "Oracle Beast -     We originally decided to start an STSO in early November 21’. It took us about 30-45 days to get necessary infra and algo implemented, we first started submitting prices on Jan 2, 2022. Because we were already running an STSO we were one of the first to start submitting on Flare when it opened around June 2022.     Our available has been relatively good since our inception, we have had various incidents where our provider had a series of of reverted submission/not submitting at all but we have alerts set up and we have always fixed our issues within hours if not minutes of them arising. Our overall uptime is between 98-99% over the last year.", "selling": "Oracle Beast     To date we have sold less than 30% of our earnings in sgb and less than 15% of our earnings of  Flare. We believe in the long term value of these assets and are hodlers by nature. The only reason we have sold what we have so far is we understand that we need to cover our Tax liabilities.", "tooling": "Oracle Beast -     So far we have not built any community facing tools, only tools we use related to our own infra.     We are in fact working on a dApp that blends blockchain, video games, and wagers. This will be built on SGB at first and then implemented on Flare as well. Utilizing both the FTSO pricing and Attestation data. This is all the details we are comfortable giving out at this time.", "sgb_claim_address": "Oracle Beast  - 0x3ed7b2ccc4ba420cdce2ba232d3efdc13075f16d", "flr_claim_address": "Oracle Beast  - 0x5E2aFfA528DB55feE8cf8cCC41d0A5bb8BaCedC3"}