{
  "name": "SolidiFi FTSO",
  "website": "https://solidifi.app",
  "twitter": "https://twitter.com/solidifiapp",
  "general": "Based in the Netherlands, SolidiFi FTSO is the data provider of SolidiFi. We are a small team that consists of 1 senior developer, 1 junior developer, and two other juniors that help with testing. Sarah, our content provider from Canada, occasionally helps with design and content. Together, we are just a group of friends making the most out of this immense opportunity to be part of the birth of a new network which we believe has fantastic potential. Lead developer, Ferdi, has studied architecture at the TU Delft, specifically the avant-garde Hyperbody research group that focussed on how artificial intelligence can aid in the design process of public buildings. Ferdi's passion for unification of aesthetics and technology is reflected in the recently launched mobile app SolidiFi Wallet.",
  "infrastructure": "For SolidiFi FTSO, we run our own infrastructure, hosted at cloud provider Digital Ocean. We run 2 observation nodes for Songbird and 2 observation nodes for Flare. For our public services (SolidiFi Web and SolidiFi Wallet) we have several APIs as well. All nodes and APIs are behind load balancers, just in case one server goes down, another one will handle the network traffic until the other server is up and running again. We have also started making preparations for running a validator node. Finally, we also run a CMS for the website and other services for the FTSO data provider (analysis etc). Current monthly infrastructure costs (for the FTSO data provider alone) are approximate $450 that we pay out of our pockets. It isn't yet an ideal setup: trade-offs are made as to not cross the limited budget but still a setup that can do the job :)",
  "safeguards": "The SolidiFi FTSO provider checks the USDT value (if available) on every exchange and converts trading prices to true USD prices. Our provider submits prices from a certain combination of exchanges. Due to its dynamic nature, if an exchange falls aways, naturally the provider continues with available exchanges. (We also monitor the availability on each exchange of the 12 assets through our custom built FTSO data provider CMS)",
  "availability": "SolidiFi FTSO data provider started submitting prices on Songbird on the 6th October 2023. For Flare it began on the 18th of October. Especially in the beginning we were finetuning our software and servers and have experienced several down times. As we are relatively new there is a lot to learn about being a provider. For instance, sometimes our prices were too late submitted so that there wasn't enough time on the blockchain to process a request (this comes down to seconds). SolidiFi FTSO data provider is one of the few that isn't boosted by Flare. So on other occasions, we simply did not have enough voting power and had to wait until we had the necessary funding to be able to submit again. While setting up our systems last year, there have been many times where we would wake up in the night just to check if everything is still submitting. It's a nice challenge and to see when all goes well feels like a great accomplishment. Today, our provider is starting to become mature and is a lot more stable than a few months ago. We will fine tune things in the weeks ahead as well to optimise rewards. Our battle for being a top provider has only just begun :)",
  "selling": "Unfortunately we are currently of the few that are not boosted by Flare. This means our rewards are about $10 to $30 a week or so (could be a little more but roughly it is only that much). As we mentioned earlier our costs on a monthly basis are $450. So the $40 to $120 worth of rewards that we earn monthly, is sold in its entirety just to have at least some financial relief.",
  "tooling": "We are currently have the following dApps at https://solidifi.app, known as SolidiFi Web:    - FTSO Data Provider list  - Wrap, delegation, rewards functionality  - Wallet with transaction history  - Dashboard with real-time assets prices from the blockchain  - Custom built governance voting for Songbird and Flare    Our precious diamond, SolidiFi Wallet is a top notch wallet for Songbird and Flare. Available for both Android and iOS it offers complete crypto-experience:     - Real time price feeds  - Detailed price info (ATH, trading volume etc)  - Combined portfolio for your XRP, Songbird and Flare accounts  - dApp Broser  - Real-time news feeds for XRP, Songbird and Flare  - Multi-wallet support (manage your family member's accounts)  - Support for read-only accounts, import any account from the network  ",
  "sgb_claim_addresses": ["0x769530a9f2e4624ae2d6869869d510d4cd55b545"],
  "flr_claim_addresses": ["0x4CfB79399cd840414a2BeF2c7C7A0cE3b9b0F89d"]
}
