{
  "name": "Sun-Dara",
  "website": "https://sun-dara.co.uk",
  "general": "I have a small team, but mainly operate solo.",
  "infrastructure": "I run my own infra, and built my own servers and wrote my own software. Monthly costs about 17USD per month, but me personally, I have a vast array of experience after doing and apprentice in working in mobile computing, and completing a degree in Computer Networks and Web Design, all the way to programming. This meant throughout my career, I have networked with a lot of small businesses resulting in lower costs. However, our upfront costs were higher, now I feel we are getting the benefits from this decision.",
  "safeguards": "Yes, we tested currency conversion regarding stable coin depegs, and this seemed to work. It was confirmed when FTX collapsed. Also we do not send a price if out checks cant gain a consensus on the price. So we try and validate the price before its passed to the S/FTSO for example, a simple validation might be, the price must be above 0. If the price is less than or equal to 0, don't send on this epoch, and I would then hope other signal providers would send what they think is correct.",
  "availability": "STSO - Octopus 2021  FTSO - July 2022  We have been down a few times, planned and unplanned. Unplanned was down to hardware fails, but as time moves on, we have added further redundancy. Planned outages were down to maintaining and upgrading hardware. We let our stakeholders know about such outages directly. However as we approach to live on both, songbird and flare we are adding added further redundancy.",
  "selling": "We have not old any FLR or SGB (0%) so far, we feel this is mainly down to us operating a budget our budgets affectively and networking with small businesses that help us source infrastructure to meet our budgets.",
  "tooling": "We have build server monitoring plug-ins and an Obfuscation service that implements 2-way encryption.",
  "sgb_claim_addresses": "0x7394923453FC2F606cfb4D0ea1A5438BB8260D08",
  "flr_claim_addresses": "0x1E8F916CE03F4ce86186531a8994d366581Ed4be"
}
