{
  "name": "TempestFTSO",
  "website": "https://tempestftso.com",
  "general": "TempestFTSO are a 3 person TSO team with many years of experience in the IT industry, with a variety of skill sets ranging from software development, security and infrastructure management. We’ve been following the Flare project for several years, we think it is a very well planned and designed blockchain. Now we have all the needed skillsets in our team we are pleased to commit the time and resource to participate in the ecosystem. Currently supporting the Flare project with price feeds, and soon, block validation services. We plan to deploy further infrastructure and software to join other attestation providers.",
  "infrastructure": "TempestFTSO own our servers and have invested a lot of time setting up \"highly available\" replicated storage and host servers, on which we host the numerous Flare project servers. We host full history copies of the blockchain on Flare, Songbird, Coston and Coston2, we run two sets of observer nodes on Flare and Songbird too. We have used over 10 Terabytes of superfast SSD storage (and counting), around 192GB of RAM and 50 CPU cores. To provide a robust FTSO service requires significant investment, as you can imagine, and we believe this is a blockchain project worth investing in.",
  "safeguards": "TempestFTSO are still pretty new to the Flare project, we are still refining our algo to further produce, with greater accuracy, what we believe to be \"correct price\" (there is no set method as to what \"correct price\" actually is). We have many diverse sources and invest time on reviewing pricing data, to ensure feeds are good quality. Other network protections are on the roadmap.",
  "availability": "TempestFTSO have been submitting on all four flare networks since the beginning of November 2022. During the last three months we’ve had a single data provider software crash, bug fixed the following day and a network switch failure. Both of these critical failures were alerted on and resolved quickly, we’ve had total of less than 60 minutes downtime for the above issues and all security maintenance (involving restarting) of our servers. System monitoring and fast response is key to ensuring a highly available service.",
  "selling": "What I will say about this contentious topic is the costs of infrastructure investment and running costs, means TempestFTSO operates at a loss, and that is not likely to change any time soon. We have been able to absorb these costs ourselves, without the need for selling any rewards so far. We plan not to sell rewards if we can avoid it. That said, there are other FTSOs who’ve needed to sell a portion of their rewards / grant to cover their running costs, we understand and don’t see a problem with this, provided Flare rewards were sold after the TDE. Unfortunately, there are several FTSO projects \"colluders\" who run a \"cloned\" shared algorithm. Because they all submit almost identical prices from the same feeds and have a large proportion of vote power they earn disproportionately high rewards and sway what the network considers \"correct price\" in their favour. This hurts all the other good independent FTSO providers by diminishing the rewards available for those not running the same shared algorithm. It also distorts what the Flare / Songbird network believes is \"correct price\". Hopefully there will be some radical changes soon to address the negative effect of colluding FTSOs on rewards and prices for the benefit of everyone and the long term heath of the system. ",
  "tooling": "In addition to further algorithm enhancements TempestFTSO will be building a web delegation app, within the next six months. TempestFTSO will continue to add features as we continue our Flare journey with the rest of you through the years to come.",
  "sgb_claim_addresses": "The blockchain never lies! :-)",
  "flr_claim_addresses": "The blockchain never lies! :-)"
}
