{"general": "The Grungies FTSO    The Grungies team consists of  two members, @mouradski and @0Llac3, both French.     Mouradski is a Java backend developer with professional experience in machine learning. To learn more about his background, you can check his LinkedIn profile https://www.linkedin.com/in/mourad-toumi-b5389178/ .   He has created several tools for the SGB and Flare ecosystems, which will be discussed in the relevant section.     Our prior experience of working together on an XRPL project, Utility Scan, which traced ODL transactions on the XRPL, has allowed us to develop a strong bond of trust and mutual understanding.    Our journey on Songbird started with the launch of a collection of NFTs inspired by the 90s Grunge music scene, followed by another series dedicated to the Metal music genre. As we gained more experience and wanted to contribute more actively, we ran a Songbird node (request made to Tom) to utilize the websocket API for our project \"Discord bot for monitoring sales on the secondary market\". Later, we decided to run an FTSO as we already had experience with exchange APIs ( Utility-Scan). This not only presents an exciting challenge, but also allows us to play a significant role in these ecosystems.  Most importantly, Mouradksi's experience allows us to be 100% independent on our algorithm and  strategies.", "infrastructure": "Grungies FTSO    Yes we run our own infra :      • Hosted at Ilyad data center in France:          ◦ Songbird node          ◦ Flare node          ◦ Both in Observe mode      •  Application server for the following software: (DP FTSO/STSO)      • IPFS cluster      • Hosted at Hetzner data center:          ◦ Flare validator  Cost : 600 Euros / Month", "safeguards": "Grungies FTSO   We determine the value of the stable coins prevalent in the market by aggregating median prices from four sources, including USDT/USD ,BUSD/USD, etc. To standardize the prices, we perform systematic conversions from the stable coins to USD.   Our algorithms for price calculation enable us to eliminate  marginal prices. ", "availability": "Grungies FTSO  We started submitting in April 2022 on Songbird and October 2022 on Flare.", "selling": "TheGrungiesFTSO  Grungies Data Provider operates on Songbird such that all the fees collected are  distributed among the holders of our NFTs.   On Flare, all the fees we collect are re-delegated .  We have been consistently managing our rewards in this manner since our inception. Maintaining transparency is of utmost importance to us and in the event of any changes in reward allocation, we will ensure to communicate it clearly and well in advance.", "tooling": "The GrungiesFTSO      • SgnNftMarketSalesDiscordBot NFT sales tracking on the secondary market, on the Flare/Songbird network and notification via a Discord bot ( https://github.com/mouradski/SgbNftMarketDiscordBot ) - Open source -              • FtsoDataProviderExample  A simple Java implementation of a Data (price) provider on Sonbird / Flare Network , ( https://github.com/mouradski/FtsoDataProviderExample )              • NftAcrCalculator ( https://github.com/mouradski/NftAcrCalculator )              • Delegation App Songbird / Flare : https://ftso.thegrungies.com/              • NftRoleUpdate Beta stage on Grungies, CFN and Sparktans discord.  ", "sgb_claim_address": "0x2c293599ca61bb53e8ff82c8a19c2a8b883ea23f", "flr_claim_address": "0x085841B253590281cc5c5222b09D4e59a605E774"}