{
  "name": "Use Your Spark",
  "website": "https://www.useyourspark.com",
  "general": "Use Your Spark are a team of four people from across Europe. We have two core developers who bring a complementary balance of blockchain, front-end and back-end skills. Additionally we have two members who focus primarily on the data science side of things, but have also many cross-over skills, that help support the developers and also cover all other aspects of day-to-day business operations. Together, the team have many decades of experience in payments and technology.",
  "infrastructure": "Use You Spark run and maintain all of their own FTSO infrastructure, which is hosted on Amazon Web Services (AWS). We have primary and back-up nodes for both Flare and Songbird as well as an additional public node to support our delegation app. We have automatic failover resilience in place, along with a comprehensive health check and monitoring system. In addition, we manage separate databases for Flare and Songbird. These databases are relatively large, with many millions of records being gathered and saved each week. We are currently running a Validator Observation node too and are also preparing to expand those into full Validator nodes within the next few weeks, in preparation for the next phase of the Flare validation process. We also have all of the required connected chains fully setup and on standby, ready to get running when the time comes for us to become an Attestation Provider. We have a core website, primarily used for marketing, and also a web3 application, that allows users to wrap, claim, delegate etc. All in all, our infrastructure resides across three continents and five countries, which helps us achieve our target of 99%+ up time. Our current infrastructure costs are typically >$7k p/m, not taking into consideration the time and effort it takes to maintain.",
  "safeguards": "Use Your Spark has a number of safeguards in place that helps protect our prices. A fundamental issue that we face, on a daily basis, as a data provider, is bad data. We spend a lot of time building resilience into our algorithms, that helps us detect and discard this bad data, automatically. Bad data is typically just a price that does not reflect what is expected, and this can happen for a multitude of reasons. We primarily focus on the identification and handling of such cases. As an example, if we are using a USDT pair from a particular exchange and they have liquidity issues and the price of USDT against USD deviates too much, we will immediately discard it from our algorithm, as it no longer represents what is expected. As another example, some (usually good) exchanges sometimes have bad spells, now and again, where they send wayward prices through their APIs for a period of time. We monitor for this kind of behaviour and again discard any data that doesn't meet our criteria.",
  "availability": "Use Your Spark have been here since the beginning and have submitted prices for every single Rewards Epoch, on both Songbird and Flare; from September 2021 on Songbird and July 2022 on Flare. In the early days we, like many providers had some small spells of downtime, as we were still figuring out how things should optimally work and what the ideal infrastructure setup should be. These experiences have served us well in the long term, as they have helped us build back better, with more stability and resilience.",
  "selling": "Use Your Spark is a business and currently our sole income is derived from the fees we charge for running our FTSO service. We, of course, need to sell some tokens to pay for our operational expenses. Amazon do not yet accept SGB or FLR, sadly!    Throughout 2022 our team took zero profit or salaries from the business. Anything that remained, after covering costs, was reinvested. That said, like with all businesses, we have shareholders, and as such there will come a time soon when this will need to be reviewed. If anyone is keen to monitor the movement of any tokens we earn from our FTSO service, they are free to do so. The wonderful nature of blockchain technology makes this not just possible, but quite easy to do.",
  "tooling": "Use Your Spark currently has it's own delegation app. We are planning to update this app soon, to expend on the feature. Additionally, we are exploring a few other ideas for future development. These things are still in the ideas phase right, so we don't have any further information to share at this stage.",
  "sgb_claim_addresses": "0x53caedda4339ed74272ecfef85b657def18fa2e4",
  "flr_claim_addresses": "0xa288054b230DCbb8689Ac229D6DBd7Df39203181"
}
