{
  "name": "Viridissima.es",
  "website": "https://ftso.viri.uk",
  "general": "Hey, this is Jamie from Viridissima TSO, currently flying solo. Besides the TSO, I have a number of projects under development in and alongside the SGB/FLR ecosystem. I am a 42 year old guy living in sunny Brighton, UK. My skillsets are many, having been writing code since the ripe old age of 8.",
  "infrastructure": "Yes, this runs circa $450/month. Currently consisting 2x AX-101 servers from Hetzner based in the Finland DC (5950X, 128G RAM, 8TB Gen 4 SSD, 24TB spinning rust for storage and backups) There are also a number of ancillary VPS instances deployed mostly in UK datacentres.",
  "safeguards": "I built a \"control panel\" for the TSO, where I can see any alerts, view/edit configurations, etc. If there are issues with price feeds, or the code that is doing the submissions majorly fails for any reason I am notified via automated phone call.",
  "availability": "Since about week 11 of Songbird, and pre-TDE on FLR. The only major downtime has been when observation nodes have failed in the past, due to buggy implementations of RocksDB being used in the old songbird code-base, and also, historically, using hardware that wasn't really up to the task (eyes OVH accusingly :) ) fortunately, this downtime is usually minimal, because AKAB! (Always keep a backup observation node)",
  "selling": "Overall, zero for both networks, as besides the income from TSO, I have other projects on SGB/FLR which have income, most of this income is wrapped and delegated. Server bills come out of my own pocket and have done for a long time. It would be nice for this to change, but in the meantime, I'll hold for that massive bull run that's just around the corner :)",
  "tooling": "So I've done smart contracts, frontends and audits for a number of projects on SGB/FLR, including Canary Punks/Flare Punks, Fat Cats, SGB Whales, CitCatClub and others. We have a website at viridissima.es (still WIP) which supports wrapping/delegating on SGB/FLR. Most of my work recently has been on an innovative new NFT marketplace, but also I have unreleased projects which are fairly complete like a DEX and a cross chain bridge (stopped development, as waiting for State Connector, no point trying to finish it if its going to need major refactoring)",
  "sgb_claim_addresses": "0x7Fc4b9A6914Efc766eFaDE3d8a9d12A3f095e165",
  "flr_claim_addresses": "0x74664cA92690C1EaD5382808dE0de4B04a2E57Ae"
}
